#include <unistd.h>


int main(int argc, char** argv)
{
    // начало на пренасочването на стандартния изход на `grep argv[1..]`
    int fds[2];
    pipe(fds);

    // конкурентно изпълнение
    if (!fork())
    {
        // затваряме четящия край на канала за писане, тъй като няма да ни е нужен в този случай
        close(fds[0]);

        // пренасочваме стандартния изход към пишещия файлов дескриптор на канала за писане
        dup2(fds[1], 1);

        argv[0] = "grep";
        execvp("grep", argv);
    }
    // край на пренасочването на `grep argv[1..]`

    // начало на пренасочването на стандартния вход на `wc -l`
    // затваряме пишещия край на канала за четене, тъй като няма да ни е нужен в този случай
    close(fds[1]);

    // пренасочваме стандартния вход от четящия файлов дескриптор на канала за четене
    dup2(fds[0], 0);

    execlp("wc", "wc", "-l", NULL);

    return 0;
}
